//----------------------------------------------------------------------------------------------------------------------------
//Mick Laboratory,  алуга 2014
//main.c  - модуль основных функций
//“ип микроконтроллера: atmega16a
//јвтор: Mick (“арасов ћихаил)
//¬ерси€ модул€: v1.00 - 13 марта 2014 
//----------------------------------------------------------------------------------------------------------------------------
#include "main.h"

#define TIMER_CLK			140		//7372800 / 256 = 28800 => 256 - 116 = 140

//-------------------------------------------------------------
//описание:описание переменных контроллера
//-------------------------------------------------------------
 unsigned char ucCPU_led_timer;
 unsigned int  uiCPU_ms_timer;
//-------------------------------------------------------------------------------------------------------------------------
// описание:  инициализаци€ оборудовани€ .
// параметры:    нет
// возвращаемое  значение:  нет
//-------------------------------------------------------------------------------------------------------------------------
void CPU_init(void)
{
  PORTA = 0xFF;                                         //порт A на вход
  DDRA  = 0x00;						

  PORTB = 0xFF;                                         //порт B кофигурируем как:
  DDRB  = 0xAA;						//TMS,STATUS,TDI,TCK - выходы

  PORTC = 0xFF;                                         //порт C на вход
  DDRC  = 0x00;						

  PORTD = 0xF7;                         		//порт D на вход: RXD, CSAVR, DATKK, DATKM,CLKK,CLKM 
  DDRD  = 0x09;				                //выход: TXD =1, RES =0

  ACSR  = 0x80;  					

  MCUCR = 0x00;						//запретим внешние прерывани€
  GICR  = 0x00; 

  TCCR0 = 0x04;						// 8-битный таймер используем CLK/256
  TCNT0 = TIMER_CLK;					//прерывание по таймеру 

  TIMSK = 0x01;						//внутреннее прерывание от 8 - битного таймера   
  TIFR  = 0x01;						//очистим флаг прерывани€ от 16 - ти битного таймера

 }                                     
//----------------------------------------------------------
//описание:     включить/выключить светодиод
//параметры:    cState  -   состо€ние светодиода
//возвращаемое  значение:  нет
//---------------------------------------------------------
void CPU_led_state(char cState)
{
 if(cState ==0) PORTB = PORTB | 0x08;
 else PORTB = PORTB & 0xF7;
 ucCPU_led_timer = 0;
}
//-------------------------------------------------------------------
// описание: прочитать состо€ние системных тиков
// параметры:       нет
// возвращаемое  значение:    количество системных тиков
//-------------------------------------------------------------------
unsigned int CPU_get_timer_ms(void)
{
 return uiCPU_ms_timer;
}
//-----------------------------------------------------------------------------------------------------------------------
// описание:  управление основным процессом.
// параметры:    нет
// возвращаемое  значение:  нет
//-------------------------------------------------------------------------------------------------------------------------
void main(void)
{
 DisableInterrupts;					//#asm("CLI")
 CPU_init();						// инициализаци€ микроконтроллера
 uiCPU_ms_timer  = 0;
 ucCPU_led_timer = 0;
 JTAG_Init();
 UART_init();
 Terminal_init();
 EnableInterrupts;                               	//#asm("SEI")
 for(;;)
  {
   Terminal_cmd_analyze();
   if(ucCPU_led_timer >= 250) 
     {
      ucCPU_led_timer = 0; 
      PORTB = PORTB ^ 0x08;
     } 
  }
}
//------------------------------------------------------------------------------------------------------------------------
// описание: обработка прерывани€ от  8 - битного таймера (через каждые 4,096mc)
// параметры:    нет
// возвращаемое  значение:  нет
//-------------------------------------------------------------------------------------------------------------------------
interrupt [TIM0_OVF] void Timer0_overlow(void)
{
 TIFR = TIFR | 0x01;					//очистим флаг прерывани€ от 8 - ти битного таймера
 TCNT0 = TIMER_CLK;					//прерывание по таймеру происходит через 4мс 
 uiCPU_ms_timer = uiCPU_ms_timer + 1;			//увеличиваем счетчик системных тиков 
 ucCPU_led_timer = ucCPU_led_timer +1; 
}
